###################
# Taps
 ###################
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'nicoverbruggen/homebrew-cask'
tap 'homebrew/bundle'

###################
# Binaries
###################
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'git-flow'
brew 'gh'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
brew 'pkg-config'
brew 'svn' # install SVN, since it is deprecated in Xcode 11 / Catalina 10.16 (see https://stackoverflow.com/questions/60869347/mac-command-line-tools-11-4-no-longer-has-svn)
brew 'htop' 
brew 'tig'
brew 'httpie'
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached 

###################
# Development
###################
brew 'php'
#brew 'imagemagick'
#brew 'libmemcached'
#brew 'memcached'
#brew 'meilisearch'
#brew 'mysql'
#brew 'redis'
brew 'nvm'
brew 'ffmpeg'
brew 'docker'

brew "spaceship"

###################
# Apps
###################

# Messengaer
cask 'whatsapp'
cask 'discord'
cask 'telegram-desktop'
cask 'slack'
cask 'skype'
cask 'signal'
cask 'zoom'

# storage
cask 'dropbox'
cask 'google-drive'

# utils
cask 'spotify'
cask '1password'
cask '1password-cli'
cask 'stats'
cask 'vlc'
cask 'bartender'
cask 'google-chrome'
cask 'imageoptim'
cask 'the-unarchiver'

# pm
cask 'nifty'
cask 'figma'

# develop
cask 'phpstorm'
cask 'visual-studio-code'
cask 'iterm2'
cask 'ray'
cask 'tinkerwell'
cask 'tint'
cask 'helo'
cask 'docker'
cask 'sizzy'
cask 'tableplus'
cask 'sourcetree'

# cask 'adobe-creative-cloud'
# cask 'google-backup-and-sync'

# cask 'gpg-suite'
# cask 'toggl'
# cask 'phpmon'
# cask 'there'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

###################
# Fonts
###################
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
#cask 'font-roboto-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-montserrat'

###################
# Mac App Store
###################
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Magnet', id: 441258766
mas 'Giphy Capture', id: 668208984
mas 'DaVinci Resolve', id: 571213070
#mas 'Tweetbot', id: 1384080005

 



