# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'


# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
brew 'pkg-config'
brew 'svn' # install SVN, since it is deprecated in Xcode 11 / Catalina 10.16 (see https://stackoverflow.com/questions/60869347/mac-command-line-tools-11-4-no-longer-has-svn)
brew 'htop' 
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached 


# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'redis'
brew 'node'

# Apps
cask '1password'
cask '1password-cli'
cask 'adobe-creative-cloud'
cask 'discord'
cask 'dropbox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'sequel-pro'
cask 'toggl'
cask 'telegram-desktop'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sourcetree'
# cask 'there'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-roboto-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-montserrat'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Magnet', id: 441258766
mas 'Giphy Capture', id: 668208984

 



